vim_introduction.org
#+TITLE: Introduction of VIM 
#+AUTHOR: Shuai Wang 
#+DATE:  04/04/2020
#+EMAIL: wang.172@wright.edu
#+SETUPFILE:  https://fniessen.github.io/org-html-themes/setup/theme-bigblow.setup


* File operations
** write/save file: :w
** quit/close: 
1. q!:     quit without save
2. wq:     write and save. Also zz
3. u:      undo
4. ctrl+r: redo

* Movement 
copy the text to your vim enabled editor.

#+NAME: example-table
#+RESULTS:
#+BEGIN_src python
apple orange red gree hi big small

demand_df = pd.DataFrame(data=np.random.random(size=(n_hours, n_bus)),
                         columns=np.arange(1, n_bus + 1),
                         index=np.arange(1, n_hours + 1))

data = {
    ('seattle',  'new-york') : 2.5,
    ('seattle',  'chicago')  : 1.7,
    ('seattle',  'topeka')   : 1.8,
    ('san-diego','new-york') : 2.5,
    ('san-diego','chicago')  : 1.8,
    ('san-diego','topeka')   : 1.4}
#+END_src

** Direction move 
1. right: h
2. left:  l
3. up:    k
4. down:  j

** By word move
1. w: foward by a word  
2. b: back by a word
3. e: to the end of the next word

** Line Navigation: exetreme point
1. 0:  beginning of the line
2. $:  end of the line
3. gg: 1st line of the file
4. G:  last line of the file
5. 3gg/3G: go to line 3 in the document

** Turbo pack: Go to the next character, word, and line
1. 4l: go the 4th character to the left
2. 4j: to the 4th line to the bottom
3. 3w: go to the 3rd word after the current word
4. 2b: go back to the 2nd word before the current word

** Ultimate movement: use find f/F and search /
*** in-line 
1. fc/Fc: find the next/previous letter c in the current line.
Not the c you want?
Repeat the procecure by using ;

*** global search 
1. /san find the next word san in the document
Not the san you want?
Go to the next/previous one by hitting enter followed by n or N

* Cut, copy and paste 
Most of operations can use Verb + Noun:
+ d for delete, w for word, combine to be "delete word"
+ numer n can be added in front of the perations: 3dw.
** delete character, word, and line
1. x: delete a character. 3x, 100x
2. d: delete 
   + dw: delete a word. 3dw.
   + daw: delete the current word including spaces.
   + dd/D: delete a line from any position. 3dd.
   + dt(): delete until a character. dt
   + di(): delete within something. di', di), di} 
3. y: yank/copy
   + yw: yank a word. 3yw, yaw.
   + yy/Y: yank a line. 3yy
   + y$: yank to the end of line
   + y0: yank to the beginning of the line
   + yt(): yank until character. yt8, yt} 
   + yi(): yank within character. yi', yi), yi}
4. p: paste
Aything you just deleted(cut), yanked can be pasted.
   + p: paste after 
   + P: paste before 

** Reddit time
Install the vimum extension 
[[https://chrome.google.com/webstore/detail/vimium/dbepggeogbaibhgnhhndojpepiihcmeb][Chrome]] 
[[https://addons.mozilla.org/en-US/firefox/addon/vimium-ff/?src=search][Firefox]]
[[https://github.com/televator-apps/vimari][Safari]]


* Insert text

Insert mode: you start to type character.
Key ESC is used to change between normal mode and insert mode
** Insert in next/above line
1. o: insert in the next line
2. O: insert above the current line
** Backward insert
1. i: insert before the current character
2. I: insert from the start of the line

** Forward insert
1. a: append to the right of the current character
2. A: append to the end of line

** repeat typing
1. try 80i# and press escape

** replace text
1. r: replace a character in normal mode


* Visual mode
Select text in highlight mode and operate

1. v + movement. eg. vl, vw
2. V: highlight a line. 
3. Ctrl + v: highlight a block. Ctrl+v+Shift+i+#

* Substitue 
1. :s/a/b/g  substitute a with b, in a line
2. :%s/a/b/g substitute a with b, in whole document
3. use visulal mode to select block to substitute.
4. :5,12s/a/b/g

* Tricks
1. Ctrl + j: append next line to the end of current line.
2. Ctrl +a/x: +/- number
3. ~: change alphabet cases 


